In [1]:
import sqlite3 as sql

In [2]:
#create a connection with a database
connection=sql.connect('deepika.db')

In [ ]:
#create a cursor object using the connection
cursor=connection.cursor()

In [5]:
cursor.execute(''' 
create table employee(
               id integer primary key,
               name varchar,
               age integer,
               city varchar );
''')

In [6]:
#savethe changes
connection.commit()

In [7]:
cursor.execute('''
insert into employee(id,name,age,city)values(1,"deepika",19,"naraingarh");
''')

In [8]:
cursor.execute('''
insert into employee(id,name,age,city)values(2,"neha",20,"ambala");
''')

In [9]:
cursor.execute('''
insert into employee(id,name,age,city)values(3,"aruna",18,"goa");
''')

In [10]:
cursor.execute('''
insert into employee(id,name,age,city)values(4,"radha",34,"delhi");
''')

In [11]:
cursor.execute('''
select*from employee;
''')
results=cursor.fetchall()

In [12]:
import pandas as pd
df=pd.DataFrame(results)
df

   0        1   2           3
0  1  deepika  19  naraingarh
1  2     neha  20      ambala
2  3    aruna  18         goa
3  4    radha  34       delhi